yangchengwork/pan1740-firmware/da14580_hci/src/plf/refip/src/arch/main/ble/arch_main.c
#if 0
static bool cmp_abs_time(struct co_list_hdr const * timerA, struct co_list_hdr const * timerB)
{
    uint32_t timeA = ((struct ke_timer*)timerA)->time;
    uint32_t timeB = ((struct ke_timer*)timerB)->time;

    return (((uint32_t)( (timeA - timeB) & 0xFFFF) ) > KE_TIMER_DELAY_MAX);
}
#endif

// h/w 
const uint32_t * const patch_table[]={
    
#ifdef __DA14581__
	(const uint32_t *) llm_rd_local_supp_feats_cmd_handler,  // mandatory for hciconfig hci0 up
	(const uint32_t *) lld_adv_start_patch,
	(const uint32_t *) llc_con_update_req_ind,
#endif
    
#ifndef __DA14581__
	(const uint32_t *) cmp_abs_time,
	(const uint32_t *) l2cc_pdu_recv_ind_handler,
	(const uint32_t *) smpc_send_pairing_req_ind,
	(const uint32_t *) smpc_check_pairing_feat,
	(const uint32_t *) smpc_pairing_cfm_handler,
	(const uint32_t *) my_llc_con_update_req_ind,
	(const uint32_t *) my_llc_ch_map_req_ind,	
	(const uint32_t *) patched_gapm_adv_op_sanity,
#else
	(const uint32_t *) NULL
#endif
};

// Coarse Calibration configuration
const struct LUT_CFG_struct LUT_CFG =
{ 
	/*.HW_LUT_MODE               =*/ 1,                     // 1: HW LUT, 0: SW LUT    
	/*.RX_HSI_ENABLED 	     =*/ 1, 
	/*.PA_PULLING_OFFSET 	     =*/ 0, 
	/*.NR_CCUPD_1ST              =*/ 10, 
	/*.NR_CCUPD_REST             =*/ 4, 
	/*.NR_CCUPD_OL               =*/ 40, 
	/*.BLE_BAND_MARGIN           =*/ 10,                    // in MHz
	/*.EST_HALF_OVERLAP 	     =*/ 4,                     // in MHz
	/*.REQUIRED_CHAN_OVERLAP     =*/ 2,                     // At least 2 channels should be synthesizable by two adjacent calcaps (both of them)
	/*.PLL_LOCK_VTUNE_NUMAVGPOW  =*/ 3,                     // So 2^3=8 samples averaging
	/*.PLL_LOCK_VTUNE_LIMIT_LO   =*/ (1024*200/1200),       // Min acceptable Vtune = 0200mV
	/*.PLL_LOCK_VTUNE_LIMIT_HI   =*/ (1024*1000/1200),      // Max acceptable Vtune = 1000mV
	/*.PLL_LOCK_VTUNE_P2PVAR     =*/ (1024*50/1200),        // Vtune has to be stable within 50mV
	/*.PLL_LOCK_TIMING	     =*/ 416,    		// 416*62.5nsec=26usec
	/*.VCO_CALCNT_STARTVAL	     =*/ 0xFFFF,    		// Just in case it is modified by the Metal Fixes
	/*.VCO_CALCNT_TIMEOUT	     =*/ 300,    		// Just in case the while loops lock in meas_precharge_freq()
};


/**
 ****************************************************************************************
 * @brief SVC_Handler. Handles h/w patching mechanism IRQ
 *
 * @return void 
 ****************************************************************************************
 */

void SVC_Handler_c(unsigned int * svc_args)

{
	// Stack frame contains:
	// r0, r1, r2, r3, r12, r14, the return address and xPSR
	// - Stacked R0 = svc_args[0]
	// - Stacked R1 = svc_args[1]
	// - Stacked R2 = svc_args[2]
	// - Stacked R3 = svc_args[3]
	// - Stacked R12 = svc_args[4]
	// - Stacked LR = svc_args[5]
	// - Stacked PC = svc_args[6]
	// - Stacked xPSR= svc_args[7]

	unsigned int svc_number;

	svc_number = ((char *)svc_args[6])[-2];

	if (svc_number < (sizeof patch_table)/4)
		svc_args[6] = (uint32_t)patch_table[svc_number];
	else
		while(1);

	return;
}

/**
 ****************************************************************************************
 * @brief Set and enable h/w Patch functions
 *
 * @return void
 ****************************************************************************************
 */

void patch_func (void)
{
	/*
	 * angelo
	 * here we have to use svc values from da14580
	 */

#ifdef __DA14581__ 

	//0x00024f23 lld_adv_start
	SetWord32(PATCH_ADDR0_REG, 0x00024f22);
	SetWord32(PATCH_DATA0_REG, 0xdf014770); // lld_adv_start svc 1 (+ enabling of interrupts)

	// 0x00027bcf OK hardly found on attempts from 27bb4 to 27c04 step 4
	SetWord32(PATCH_ADDR1_REG, 0x00027bcc); 
	SetWord32(PATCH_DATA1_REG, 0xdf00b662); // llm_rd_local_supp_feats_cmd_handler svc 0

	// 0x00027b97 OK found subctracting fixed offs from above 581 offset
	SetWord32(PATCH_ADDR2_REG, 0x00027b94); // llm_rd_local_ver_info_cmd_handler
	SetWord32(PATCH_DATA2_REG, 0x80c121d2); // patch manufacturer ID

	// 0x00022e29
	SetWord32(PATCH_ADDR3_REG, 0x00022e26); // llc_version_ind_pdu_send
	SetWord32(PATCH_DATA3_REG, 0x80d020d2); // patch manufacturer ID
	
	// 0x000233bf  llc_con_update_req_ind
	SetWord32(PATCH_ADDR4_REG, 0x000233bc);
	SetWord32(PATCH_DATA4_REG, 0xdf02bdf8); //llc_con_update_req_ind svc 2

#endif

#if 0
	//0x0002a32b l2cc_pdu_recv_ind_handler (atts)
	SetWord32(PATCH_ADDR4_REG, 0x0002a328);
	SetWord32(PATCH_DATA4_REG, 0xdf02bdf8); //l2cc_pdu_recv_ind_handler svc 2
	
	//0x000233bf  llc_con_update_req_ind
	SetWord32(PATCH_ADDR5_REG, 0x000233bc);
	SetWord32(PATCH_DATA5_REG, 0xdf03e7f5); //llc_con_update_req_ind svc 3

	//0x0002341b  llc_ch_map_req_ind
	SetWord32(PATCH_ADDR6_REG, 0x00023418);
	SetWord32(PATCH_DATA6_REG, 0xdf04b089); //llc_ch_map_req_ind svc 4

	//0x00030cef gapm_adv_op_sanity
	SetWord32(PATCH_ADDR7_REG, 0x00030cec);
	SetWord32(PATCH_DATA7_REG, 0xdf05bdf8); //gapm_adv_op_sanity svc 5
	
	/* no more space */
	
	//0x00032795 cmp_abs_time
	//SetWord32(PATCH_ADDR0_REG, 0x00032794);
	//SetWord32(PATCH_DATA0_REG, 0xdf00b662); //cmp_abs_time svc 0 (+ enabling of interrupts)

	//0x0002ca1f  smpc_send_pairing_req_ind
	//SetWord32(PATCH_ADDR2_REG, 0x0002ca1c);
	//SetWord32(PATCH_DATA2_REG, 0xdf02bdf8); //smpc_send_pairing_req_ind svc 2

	//0x0002cb43  smpc_check_pairing_feat
	//SetWord32(PATCH_ADDR3_REG, 0x0002cb40);
	//SetWord32(PATCH_DATA3_REG, 0xdf03e7f5); //smpc_check_pairing_feat svc 3

	//0x0002d485  smpc_pairing_cfm_handler
	//SetWord32(PATCH_ADDR4_REG, 0x0002d484);
	//SetWord32(PATCH_DATA4_REG, 0xb089df04); //smpc_pairing_cfm_handler svc 4
	//SetWord32(PATCH_DATA4_REG, 0xdf04b089); // angelo, trying
	
	/* MANDATORY */
	SetWord32(PATCH_ADDR0_REG, 0x00027bcc); 
	SetWord32(PATCH_DATA0_REG, 0xdf00b662); // llm_rd_local_supp_feats_cmd_handler svc 0
	
	SetWord32(PATCH_ADDR1_REG, 0x0002a328);
	SetWord32(PATCH_DATA1_REG, 0xdf014770); // l2cc_pdu_recv_ind_handler svc 1

