yangchengwork/pan1740-firmware/da14580_hci/src/plf/refip/src/arch/main/ble/arch_main.c
	//0x00024f23 lld_adv_start
	SetWord32(PATCH_ADDR2_REG, 0x00032794);
	SetWord32(PATCH_DATA2_REG, 0xdf02bdf8); // cmp_abs_time svc 0 (+ enabling of interrupts)
	//0x00032795 cmp_abs_time
	//SetWord32(PATCH_ADDR0_REG, 0x00032794);
	//SetWord32(PATCH_DATA0_REG, 0xdf00b662); //cmp_abs_time svc 0 (+ enabling of interrupts)

	//0x0002a32b l2cc_pdu_recv_ind_handler (atts)
	//SetWord32(PATCH_ADDR1_REG, 0x0002a328);
	//SetWord32(PATCH_DATA1_REG, 0xdf014770); //l2cc_pdu_recv_ind_handler svc 1

	//0x0002ca1f  smpc_send_pairing_req_ind
	//SetWord32(PATCH_ADDR2_REG, 0x0002ca1c);
	//SetWord32(PATCH_DATA2_REG, 0xdf02bdf8); //smpc_send_pairing_req_ind svc 2

	//0x0002cb43  smpc_check_pairing_feat
	SetWord32(PATCH_ADDR3_REG, 0x0002cb40);
	SetWord32(PATCH_DATA3_REG, 0xdf03e7f5); //smpc_check_pairing_feat svc 3

	//0x0002d485  smpc_pairing_cfm_handler
	SetWord32(PATCH_ADDR4_REG, 0x0002d484);
	//SetWord32(PATCH_DATA4_REG, 0xdf04b089); //smpc_pairing_cfm_handler svc 4
	SetWord32(PATCH_DATA4_REG, 0xb089df04);

	//0x000233bf  llc_con_update_req_ind
	SetWord32(PATCH_ADDR5_REG, 0x000233bc);
	SetWord32(PATCH_DATA5_REG, 0xdf05bdf8); //llc_con_update_req_ind svc 5

	//0x0002341b  llc_ch_map_req_ind
	SetWord32(PATCH_ADDR6_REG, 0x00023418);
	SetWord32(PATCH_DATA6_REG, 0xdf06bdf8); //llc_ch_map_req_ind svc 6

	//0x00030cef gapm_adv_op_sanity
	SetWord32(PATCH_ADDR7_REG, 0x00030cec);
	SetWord32(PATCH_DATA7_REG, 0xdf07bd70); //gapm_adv_op_sanity svc 7

	NVIC_DisableIRQ(SVCall_IRQn);
	NVIC_SetPriority(SVCall_IRQn, 0);
	NVIC_EnableIRQ(SVCall_IRQn);
#endif
}

extern void set_sleep_delay(void);

void lld_sleep_init_func(void)
{
	// Clear the environment
	memset(&lld_sleep_env, 0, sizeof(lld_sleep_env));

	// Set wakeup_delay
	set_sleep_delay();

	// Enable external wake-up by default
	ble_extwkupdsb_setf(0);
}

/**
 ****************************************************************************************
 * @brief otp_prepare()
 *
 * About: Prepare OTP Controller in order to be able to reload SysRAM at the next power-up
 ****************************************************************************************
 */
static __inline void  otp_prepare(uint32 code_size)
{
	// Enable OPTC clock in order to have access
	SetBits16 (CLK_AMBA_REG, OTP_ENABLE, 1);

	// Wait a little bit to start the OTP clock...
	for(uint8 i=0;i<10;i++); //change this later to a defined time  

	SetBits16(SYS_CTRL_REG, OTP_COPY, 1);

	// Copy the size of software from the first word of the retaintion mem.
	SetWord32 (OTPC_NWORDS_REG, code_size - 1);

	// And close the OPTC clock to save power
	SetBits16 (CLK_AMBA_REG, OTP_ENABLE, 0);
}

/*
 * EXPORTED FUNCTION DEFINITIONS
 ****************************************************************************************
 */


/*
 * MAIN FUNCTION
 ****************************************************************************************
 */
extern void set_system_clocks(void);
extern void init_pwr_and_clk_ble(void);
extern void rf_workaround_init(void);

/**
 ****************************************************************************************
 * @brief BLE main function.
 *
 * This function is called right after the booting process has completed.
 ****************************************************************************************
 */
int main_func(void) __attribute__((noreturn));

int main_func(void)
{
	volatile unsigned i;
	sleep_mode_t sleep_mode; // keep at system RAM. On each while loop it will get a new value. 

	sys_startup_flag = true;
	
	/*
	************************************************************************************
	* Platform initialization
	************************************************************************************
	*/
#if (USE_WDOG)
	SetWord16(WATCHDOG_REG, 0xC8);          // 200 * 10.24ms = ~2sec active time!
	SetWord16(WATCHDOG_CTRL_REG, 0);        // Generate an NMI when counter reaches 0 and a WDOG (SYS) Reset when it reaches -16!
					    // WDOG can be frozen by SW!
	SetWord16(RESET_FREEZE_REG, FRZ_WDOG);  // Start WDOG
#else
	SetWord16(SET_FREEZE_REG, FRZ_WDOG);
#endif
    
#if defined(CFG_USE_DEFAULT_XTAL16M_TRIM_VALUE_IF_NOT_CALIBRATED)
#define DEFAULT_XTAL16M_TRIM_VALUE (1302)
	// Apply the default XTAL16 trim value if a trim value has not been programmed in OTP
	if ( 0 == GetWord16(CLK_FREQ_TRIM_REG) )
	{
		SetBits16(CLK_16M_REG, RC16M_ENABLE, 1);                      // enable RC 16MHz
		for (volatile int i = 0; i < 20; i++);

		SetBits16(CLK_CTRL_REG, SYS_CLK_SEL, 1);                      // switch to  RC16
		while( (GetWord16(CLK_CTRL_REG) & RUNNING_AT_RC16M) == 0 );   // wait for actual switch

		SetBits16(CLK_CTRL_REG, XTAL16M_DISABLE, 1);                  // disable XTAL16
		SetWord16(CLK_FREQ_TRIM_REG, DEFAULT_XTAL16M_TRIM_VALUE);     // set default trim value
		SetBits16(CLK_CTRL_REG, XTAL16M_DISABLE, 0);                  // enable XTAL16
		while( (GetWord16(SYS_STAT_REG) & XTAL16_SETTLED) == 0 );     // wait for XTAL16 settle

		SetBits16(CLK_CTRL_REG , SYS_CLK_SEL ,0);                     // switch to  XTAL16
		while( (GetWord16(CLK_CTRL_REG) & RUNNING_AT_XTAL16M) == 0 ); // wait for actual switch
	}
#endif
	
	set_system_clocks();
	GPIO_init();
	periph_init();	
    
	/* Don't remove next line otherwhise dummy[0] could be optimized away
	* The dummy array is intended to reserve the needed Exch.Memory space in retention memory
	*/
	dummy[0] = dummy[0];
	descript[0] = descript[0];

#ifndef __DA14581__    
#if (BLE_CONNECTION_MAX_USER > 4)
	cs_table[0] = cs_table[0];
#endif
#else
#if (BLE_CONNECTION_MAX_USER > 1)
	cs_table[0] = cs_table[0];
#endif
#endif
	// Initialize random process
	srand(1);

	// Initialize the exchange memory interface, emi in RAM for the time being, so no init necessary
#if 0
	emi_init();
#endif
	// Initialize NVDS module
	nvds_init((uint8_t *)NVDS_FLASH_ADDRESS, NVDS_FLASH_SIZE);

	//check and read BDADDR from OTP
	nvds_read_bdaddr_from_otp();
	
#ifdef RADIO_580
	iq_trim_from_otp();
#endif

