yangchengwork/pan1740-firmware/da14580_hci/src/plf/refip/src/arch/main/ble/arch_main.c
	/*
	************************************************************************************
	* BLE initialization
	************************************************************************************
	*/
	init_pwr_and_clk_ble(); 

#if UNCALIBRATED_AT_FAB
	SetBits16(BANDGAP_REG, BGR_TRIM, 0x0);  // trim RET Bandgap
	SetBits16(BANDGAP_REG, LDO_RET_TRIM, 0xA);  // trim RET LDO
	SetWord16(RF_LNA_CTRL1_REG, 0x24E);
	SetWord16(RF_LNA_CTRL2_REG, 0x26);
	SetWord16(RF_LNA_CTRL3_REG, 0x7);
	SetWord16(RF_VCO_CTRL_REG, 0x1);
	SetBits16(CLK_16M_REG, RC16M_TRIM, 0xA);
#endif
	
	// Initialize BLE stack 
	NVIC_ClearPendingIRQ(BLE_SLP_IRQn);     
	NVIC_ClearPendingIRQ(BLE_EVENT_IRQn); 
	NVIC_ClearPendingIRQ(BLE_RF_DIAG_IRQn);
	NVIC_ClearPendingIRQ(BLE_RX_IRQn);
	NVIC_ClearPendingIRQ(BLE_CRYPT_IRQn);
	NVIC_ClearPendingIRQ(BLE_FINETGTIM_IRQn);	
	NVIC_ClearPendingIRQ(BLE_GROSSTGTIM_IRQn);	
	NVIC_ClearPendingIRQ(BLE_WAKEUP_LP_IRQn);   
	
	rwip_init(error);
	
#if ((BLE_APP_PRESENT == 0 || BLE_INTEGRATED_HOST_GTL == 1) && BLE_HOST_PRESENT )
	patch_gtl_task();
#endif // #if (BLE_APP_PRESENT == 0 || BLE_INTEGRATED_HOST_GTL == 1)
    
	/* Set spi to HW (Ble)
	 * Necessary: So from this point the BLE HW can generate spi burst iso SW
	 * SPI BURSTS are necessary for the radio TX and RX burst, done by hardware
	 * beause of the accurate desired timing 
	 */
	//FPGA
#ifdef FPGA_USED    
	SetBits32(BLE_CNTL2_REG,SW_RPL_SPI ,1);
#endif
	//Enable BLE core    
	SetBits32(BLE_RWBTLECNTL_REG,RWBLE_EN ,1); 

#if RW_BLE_SUPPORT && HCIC_ITF

	// If FW initializes due to FW reset, send the message to Host
	if(error != RESET_NO_ERROR)
	{
		rwble_send_message(error);
	}
#endif

	/*
	 ************************************************************************************
	 * Sleep mode initializations (especially for full embedded)
	 ************************************************************************************
	 */
#if (EXT_SLEEP_ENABLED)
	app_set_extended_sleep();
#elif (DEEP_SLEEP_ENABLED)
	app_set_deep_sleep();
#else
	app_disable_sleep();
#endif    
   
	if (lp_clk_sel == LP_CLK_RCX20)
	{    
		calibrate_rcx20(20);
		read_rcx_freq(20);  
	}
	
	/*
	 ************************************************************************************
	 * Application initializations
	 ************************************************************************************
	 */
      
#if (BLE_APP_PRESENT)    
	{
		app_init();         // Initialize APP
	}
#endif /* #if (BLE_APP_PRESENT) */
    
	/*
	************************************************************************************
	* Main loop
	************************************************************************************
	*/
	lld_sleep_init_func();

	SetWord16(TRIM_CTRL_REG, 0xA2);
	SetBits16(CLK_16M_REG, XTAL16_CUR_SET, 0x5);
    
	enable_rf_diag_irq(RF_DIAG_IRQ_MODE_RXTX); 

	if ( (app_get_sleep_mode() == 2) || (app_get_sleep_mode() == 1) )
	{
		SetWord16(SET_FREEZE_REG, FRZ_WDOG);            // Stop WDOG until debugger is removed
		while ((GetWord16(SYS_STAT_REG) & DBG_IS_UP) == DBG_IS_UP) {}; 
		SetBits16(SYS_CTRL_REG, DEBUGGER_ENABLE, 0);    // close debugger
	}	
	
	/*
	************************************************************************************
	* Watchdog
	************************************************************************************
	*/
#if (USE_WDOG)
	SetWord16(WATCHDOG_REG, 0xC8);          // 200 * 10.24ms active time for initialization!
	SetWord16(RESET_FREEZE_REG, FRZ_WDOG);  // Start WDOG
#endif

    
#if (STREAMDATA_QUEUE)
	stream_fifo_init ();
#endif    
	
	/*
	 ************************************************************************************
	 * Main loop
	 ************************************************************************************
	 */
     
	while(1)
	{   
		// schedule all pending events
		if(GetBits16(CLK_RADIO_REG, BLE_ENABLE) == 1) { 
			// BLE clock is enabled
			if(GetBits32(BLE_DEEPSLCNTL_REG, DEEP_SLEEP_STAT) == 0 && !(rwip_prevent_sleep_get() & RW_WAKE_UP_ONGOING)) { // BLE is running

#ifndef FPGA_USED            
				uint8_t ble_evt_end_set = ke_event_get(KE_EVENT_BLE_EVT_END); // BLE event end is set. conditional RF calibration can run.
#endif                
				rwip_schedule();  

#ifndef FPGA_USED            
				if (ble_evt_end_set)
				{
					uint32_t sleep_duration = 0;

					if (lp_clk_sel == LP_CLK_RCX20)
						read_rcx_freq(20);

					if (lld_sleep_check(&sleep_duration, 4)) //6 slots -> 3.750 ms
						conditionally_run_radio_cals(); // check time and temperature to run radio calibrations. 
				}

#endif
                
#if (BLE_APP_PRESENT)
				if ( app_asynch_trm() )
					continue; // so that rwip_schedule() is called again
#endif
                
#ifdef CFG_PRINTF
				{
					arch_printf_process();
				}
#endif                
			}	
		} 
        
#if (BLE_APP_PRESENT)
		// asynchronous events processing
		if (app_asynch_proc())
			continue; // so that rwip_schedule() is called again
#endif

#if (STREAMDATA_QUEUE)        
		if (stream_queue_more_data( ))
			continue;
#endif
        
#if (!BLE_APP_PRESENT)
		if (check_gtl_state())
#endif
		{
			GLOBAL_INT_STOP();

#if (BLE_APP_PRESENT)
			app_asynch_sleep_proc();
#endif        

			sleep_mode = rwip_sleep();
        
			// BLE is sleeping ==> app defines the mode
			if (sleep_mode == mode_sleeping) {
				if (sleep_env.slp_state == ARCH_EXT_SLEEP_ON) {
					sleep_mode = mode_ext_sleep;
				} else {
					sleep_mode = mode_deep_sleep;
				}
			}
            
			if (sleep_mode == mode_ext_sleep || sleep_mode == mode_deep_sleep) 
			{
				SetBits16(PMU_CTRL_REG, RADIO_SLEEP, 1); // turn off radio

				if (jump_table_struct[nb_links_user] > 1)
				{
					if( (sleep_mode == mode_deep_sleep) && func_check_mem() && test_rxdone() && ke_mem_is_empty(KE_MEM_NON_RETENTION) )
					{
						func_check_mem_flag = 2;//true;
					}
					else
						sleep_mode = mode_ext_sleep;
				}
				else
				{
					if( (sleep_mode == mode_deep_sleep) && ke_mem_is_empty(KE_MEM_NON_RETENTION) )
					{
						func_check_mem_flag = 1;//true;
					}
					else
						sleep_mode = mode_ext_sleep;
				}
                
#if (BLE_APP_PRESENT)
				// hook for app specific tasks when preparing sleeping
				app_sleep_prepare_proc(&sleep_mode);
#endif
				if (sleep_mode == mode_ext_sleep || sleep_mode == mode_deep_sleep)
				{
					SCB->SCR |= 1<<2; // enable sleepdeep mode bit in System Control Register (SCR[2]=SLEEPDEEP)

					SetBits16(SYS_CTRL_REG, PAD_LATCH_EN, 0);           // activate PAD latches
					SetBits16(PMU_CTRL_REG, PERIPH_SLEEP, 1);           // turn off peripheral power domain
					if (sleep_mode == mode_ext_sleep) {
						SetBits16(SYS_CTRL_REG, RET_SYSRAM, 1);         // retain System RAM
						SetBits16(SYS_CTRL_REG, OTP_COPY, 0);           // disable OTP copy	  
					} else { // mode_deep_sleep
#if DEVELOPMENT_DEBUG
						SetBits16(SYS_CTRL_REG, RET_SYSRAM, 1);         // retain System RAM		
#else
						SetBits16(SYS_CTRL_REG, RET_SYSRAM, 0);         // turn System RAM off => all data will be lost!
#endif
						otp_prepare(0x1FC0);                            // this is 0x1FC0 32 bits words, so 0x7F00 bytes 
					}
				}

				SetBits16(CLK_16M_REG, XTAL16_BIAS_SH_DISABLE, 0);
                
#if (BLE_APP_PRESENT)
				// hook for app specific tasks just before sleeping
				app_sleep_entry_proc(&sleep_mode);
#endif

#if ((EXTERNAL_WAKEUP) && (!BLE_APP_PRESENT)) // external wake up, only in external processor designs
				ext_wakeup_enable(EXTERNAL_WAKEUP_GPIO_PORT, EXTERNAL_WAKEUP_GPIO_PIN, EXTERNAL_WAKEUP_GPIO_POLARITY);
#endif
                
				WFI();

#if (BLE_APP_PRESENT)
				// hook for app specific tasks just after waking up
				app_sleep_exit_proc(sleep_mode);
#endif

#if ((EXTERNAL_WAKEUP) && (!BLE_APP_PRESENT)) // external wake up, only in external processor designs
				// Disable external wakeup interrupt
				ext_wakeup_disable();
#endif
				// reset SCR[2]=SLEEPDEEP bit else the mode=idle WFI will cause a deep sleep 
				// instead of a processor halt
				SCB->SCR &= ~(1<<2);
			}
			else if (sleep_mode == mode_idle) 
			{
#if (!BLE_APP_PRESENT)              
				if (check_gtl_state())
#endif
				{
				    WFI();
				}
			}
            
			// restore interrupts
			GLOBAL_INT_START();
		}

#if (USE_WDOG)        
		SetWord16(WATCHDOG_REG, 0xC8);          // Reset WDOG! 200 * 10.24ms active time for normal mode!
#endif
	}
}

/// @} DRIVERS
